cylinder/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;  // Set to the number of cores you want to use

method          scotch;  // Alternative methods: simple, hierarchical, metis
roots           ( );

// Optional settings for other decomposition methods
// simpleCoeffs
// {
//     n               (2 2 1);
//     delta           0.001;
// }

// Optional distributed triSurface refinement
distributed     yes;

// ************************************************************************* //